src/InformationRegisters/ИС_МВМ_СоответствиеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_МВМ_СоответствиеТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварМВМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ОграничениеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ОграничениеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_РучныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_РучныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ПоследниеВыгруженныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ПоследниеВыгруженныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ИС_МВМ_Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_МВМ_Склады</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>warehouseCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяГруппаСкладов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиИзГруппыСкладов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначенияПолей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставкиЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьСхемуFBO</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиСоздаватьОрдерНаОтгрузку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыРасходныхОрдеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСтрокиРасходногоОрдера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияСоСтрокамиОрдеровНаОтгрузку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладскоеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеревозчикПартнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппаСкладов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаправленияДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаправлениеДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>Номенклатура</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/ИС_МВМ_Сервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ПолучитьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияМВМ Тогда
		Возврат;
	КонецЕсли;
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, Перечисления.ИС_МП_Маркетплейсы.МВМ, МассивНастроек);

	СтруктураПараметров = Новый Структура;

	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить("МВМ" + Элемент.Ключ, Элемент.Значение);	
	КонецЦикла;
		
	ЗаполнитьЗначенияСвойств(Форма, СтруктураПараметров);
	
	МассивНастроек = Новый Массив;
	МассивНастроек.Добавить("AccessToken");
	МассивНастроек.Добавить("RefreshToken");
	
	СтруктураНастроек = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Форма.Объект.Ссылка, 
		Перечисления.ИС_МП_Маркетплейсы.МВМ, МассивНастроек, "Строка");
		
	Форма.МВМAccessToken = СтруктураНастроек.AccessToken;
	Форма.МВМRefreshToken = СтруктураНастроек.RefreshToken;
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Процедура ЗаписатьНастройки(Форма) Экспорт
	
	Если Не Форма.Объект.ИнтеграцияМВМ Тогда
		Возврат;
	КонецЕсли;
	
	МассивНастроек = МассивНастроекПодключения();
	МассивНастроек = МассивНастроекОстатков(МассивНастроек);
	МассивНастроек = МассивНастроекЦен(МассивНастроек);
	
	СтруктураНастроек = Новый Структура;
	
	Для Каждого Элемент Из МассивНастроек Цикл
		
		Если Элемент = "AccessToken" Или Элемент = "RefreshToken" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураНастроек.Вставить("МВМ" + Элемент, Неопределено);
		
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(СтруктураНастроек, Форма);
	
	СтруктураПараметров = Новый Структура;
	
	Для Каждого Элемент Из СтруктураНастроек Цикл
		СтруктураПараметров.Вставить(СтрЗаменить(Элемент.Ключ, "МВМ", ""), Элемент.Значение);	
	КонецЦикла;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("AccessToken", Форма.МВМAccessToken);
	СтруктураПараметров.Вставить("RefreshToken", Форма.МВМRefreshToken);
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Форма.Объект.Ссылка, Маркетплейс, СтруктураПараметров, "Строка");
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция МассивНастроекПодключения(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("АдресСервисаAPI");
	МассивНастроек.Добавить("Порт");
	МассивНастроек.Добавить("ЗащищенноеСоединение");
	МассивНастроек.Добавить("ClientId");
	МассивНастроек.Добавить("ApiKey");
	МассивНастроек.Добавить("AccessToken");
	МассивНастроек.Добавить("AccessTokenИстекает");
	МассивНастроек.Добавить("RefreshToken");
	МассивНастроек.Добавить("RefreshTokenИстекает");
	МассивНастроек.Добавить("РежимОтладки");
		
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001 

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция МассивНастроекОстатков(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("РассчитыватьНесобранныеКомплекты");
	МассивНастроек.Добавить("ВыгружатьОстаткиВРазрезеОрганизации");
	МассивНастроек.Добавить("ИспользоватьПоследниеОстатки");	
	МассивНастроек.Добавить("ИспользоватьФиксированныйОстаток");
	МассивНастроек.Добавить("ФиксированныйОстаток");
	МассивНастроек.Добавить("РежимСокрытияОстатков");
	МассивНастроек.Добавить("СкрываемыйОстаток");
	
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
Функция МассивНастроекЦен(МассивНастроек = Неопределено) Экспорт
	
	Если МассивНастроек = Неопределено Тогда
		МассивНастроек = Новый Массив;
	КонецЕсли;
	
	МассивНастроек.Добавить("ВидЦены");
		
	Возврат МассивНастроек;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 21.10.24 УА #68001
	
#КонецОбласти

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ТестПодключения(Профиль, Параметры) Экспорт

	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	
	ПараметрыЗапроса.Сервер = Параметры.АдресСервисаAPI;
	ПараметрыЗапроса.Порт = Параметры.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = Параметры.ЗащищенноеСоединение;
	
	РезультатЗапроса = ПолучитьТокен(Профиль, ПараметрыЗапроса, Параметры);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат "Тест подключения API завершился с ошибкой";
	КонецЕсли;
	
	Возврат "Тест подключения выполнен успешно";
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 22.10.24 УА #68001
Функция ПолучитьТокен(Профиль, ПараметрыЗапроса, Параметры) Экспорт
	
	ТелоСтруктура = Новый Структура;
	ТелоСтруктура.Вставить("clientName", Параметры.ClientId);
	ТелоСтруктура.Вставить("clientSecret", Параметры.ApiKey);

	РезультатЗапроса = ИС_МВМ_АПИ.ПолучитьТокен(Профиль, ПараметрыЗапроса, ТелоСтруктура);
	
	Если РезультатЗапроса = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("AccessTokenИстекает", ИС_МП_Сервер.ДатаИзUnixTimeStamp(РезультатЗапроса.expiresAt));
	СтруктураПараметров.Вставить("RefreshTokenИстекает", ИС_МП_Сервер.ДатаИзUnixTimeStamp(РезультатЗапроса.refreshExpiresAt));
	
	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров); 
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("AccessToken", РезультатЗапроса.accessToken);
	СтруктураПараметров.Вставить("RefreshToken", РезультатЗапроса.refreshToken);

	ИС_МП_Сервер.ЗаписатьЗначениеНастроек(Профиль, Маркетплейс, СтруктураПараметров, "Строка");
	
	Возврат РезультатЗапроса;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 22.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 07.11.24 УА #68001
Процедура ВыполнитьКомандуРеглЗадания(Профиль, ИдентификаторКомандыОбработки) Экспорт

	Событие = ИмяСобытия("ВыполнитьКомандуРеглЗадания");
	 
	Если ИдентификаторКомандыОбработки = "ВыгрузкаОстатковМВМ" Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_МВМ_Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИС_МВМ_Склады КАК ИС_МВМ_Склады
		|ГДЕ
		|	НЕ ИС_МВМ_Склады.ПометкаУдаления
		|	И ИС_МВМ_Склады.Профиль = &Профиль
		|	И НЕ(ИС_МВМ_Склады.ОбщаяГруппаСкладов = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И ИС_МВМ_Склады.Склад = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка)
		|				И НЕ ИС_МВМ_Склады.ВыгружатьОстаткиИзГруппыСкладов)";
		
		Запрос.УстановитьПараметр("Профиль", Профиль);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ВыгрузитьОстатки(Профиль, Выборка.Ссылка);
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 07.11.24 УА #68001

#Область РаботаСТоварами

//+ ИнфоСофт Ивонин К.А. 03.03.25 УА #92887
Функция КоличествоТоваров(Профиль) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество
	|ИЗ
	|	Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
	|ГДЕ
	|	ИС_МВМ_Товары.Профиль = &Профиль";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаКоличества = РезультатЗапроса.Выбрать();
	
	Если ВыборкаКоличества.Следующий() Тогда
		Возврат ВыборкаКоличества.Количество;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 03.03.25 УА #92887

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ОбработатьДопПараметрыЗагрузкиТоваров(ДопПараметры) Экспорт	
	
	ПараметрыТаблицы = Новый Структура;
	ПараметрыТаблицы.Вставить("СпособЧтенияЗначений", СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ПараметрыТаблицы.Вставить("ПерваяСтрока", 2);
	ТаблицаТоваров = ИС_МП_Сервер.ТаблицаЗначенийИзExcel(ДопПараметры.Адрес, ПараметрыТаблицы);
	
	Если ТаблицаТоваров = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	МассивУдаляемыхСтрок = Новый Массив;
	
	Для Каждого Строка Из ТаблицаТоваров Цикл
		
		Если Строка.СхемаПродажи <> "Маркетплейс" Тогда
			МассивУдаляемыхСтрок.Добавить(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого Элемент Из МассивУдаляемыхСтрок Цикл
		ТаблицаТоваров.Удалить(Элемент);	
	КонецЦикла;
	
	ДопПараметры = Новый Структура("Таблица", ТаблицаТоваров);
	Возврат ДопПараметры;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 25.10.24 УА #68001
Функция ЗагрузитьТовары(Профиль, Перезаполнять, ДопПараметры) Экспорт
		
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("SapМВидео", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТЗ.Колонки.Добавить("ДатаПубликации", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	
	Для Каждого Строка Из ДопПараметры.Таблица Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.SapМВидео = Строка.Sap_кодМвидео;
		НоваяСтрока.ДатаПубликации = ?(Перезаполнять, ТекущаяДатаСеанса(), Строка.ДатаПубликацииВЛКП);	
		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.SapМВидео КАК SapМВидео,
	|	ТЗ.ДатаПубликации КАК ДатаПубликации
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.SapМВидео КАК SapМВидео,
	|	ЕСТЬNULL(ИС_МВМ_Товары.Ссылка, ЗНАЧЕНИЕ(Справочник.ИС_МВМ_Товары.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
	|		ПО ВТ_Товары.SapМВидео = ИС_МВМ_Товары.SapМВидео
	|			И (ИС_МВМ_Товары.Профиль = &Профиль)
	|ГДЕ
	|	(ИС_МВМ_Товары.Ссылка ЕСТЬ NULL
	|			ИЛИ ВТ_Товары.ДатаПубликации > ИС_МВМ_Товары.ДатаПубликации)";
		
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	Запрос.УстановитьПараметр("Профиль", Профиль);
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ВсегоТоваров = Выборка.Количество();
	
	Счетчик = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = ДопПараметры.Таблица.НайтиСтроки(Новый Структура("Sap_кодМвидео", Выборка.SapМВидео));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьИлиОбновитьТовар(Профиль, Выборка.Ссылка, Выборка.SapМВидео, НайденныеСтроки[0]);

		Если Счетчик % 50 = 0 Тогда
			ДлительныеОперации.СообщитьПрогресс( , "Уже обработано " + Счетчик + " из " + ВсегоТоваров + " товаров");
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
		
	Возврат "Загрузка завершена. Всего обработкано " + Счетчик + " элементов";	

КонецФункции //- ИнфоСофт Ивонин К.А. 25.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ТекстЗапросаСопоставления() Экспорт

	Текст =
	"ВЫБРАТЬ
	|	ИС_МВМ_Товары.Ссылка КАК ТоварМВМ,
	|	ИС_МВМ_Товары.Артикул КАК АртикулМВМ,
	|	ИС_МВМ_Товары.Штрихкод КАК ШтрихкодМВМ,
	|	ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
	|	ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
	|	ВЫБОР
	|		КОГДА ИС_МВМ_СоответствиеТоваров.Упаковка = &ПустаяУпаковка
	|				ИЛИ ИС_МВМ_СоответствиеТоваров.Упаковка ЕСТЬ NULL
	|			ТОГДА ИС_МВМ_СоответствиеТоваров.Номенклатура.ЕдиницаИзмерения
	|		ИНАЧЕ ИС_МВМ_СоответствиеТоваров.Упаковка
	|	КОНЕЦ КАК Упаковка
	|ИЗ
	|	Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МВМ_СоответствиеТоваров КАК ИС_МВМ_СоответствиеТоваров
	|		ПО (ИС_МВМ_СоответствиеТоваров.Профиль = &Профиль
	|				И ИС_МВМ_Товары.Ссылка = ИС_МВМ_СоответствиеТоваров.ТоварМВМ)
	|ГДЕ
	|	ИС_МВМ_Товары.Профиль = &Профиль
	|	И НЕ ИС_МВМ_Товары.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура,
	|	ТоварМВМ";  
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ДобавитьСоответствиеТовара(Профиль, ТоварМВМ, Номенклатура, Характеристика, Упаковка, 
		ТекНоменклатура, ТекХарактеристика) Экспорт
		
	НаборЗаписей = РегистрыСведений.ИС_МВМ_СоответствиеТоваров.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Профиль.Установить(Профиль);
	НаборЗаписей.Отбор.ТоварМВМ.Установить(ТоварМВМ);
		
	НаборЗаписей.Прочитать(); 
	
	ТребуетсяНоваяЗапись = Истина;	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		Для Каждого Запись Из НаборЗаписей Цикл
		
			Если Запись.Номенклатура = ТекНоменклатура И Запись.Характеристика = ТекХарактеристика Тогда
			
				Запись.Номенклатура = Номенклатура;
				Запись.Характеристика = Характеристика;
				Запись.Упаковка = Упаковка;
        		ТребуетсяНоваяЗапись = Ложь;
        		Прервать;
			
			КонецЕсли;
		
		КонецЦикла; 	
	
	КонецЕсли;
   
    Если ТребуетсяНоваяЗапись Тогда
	
		НоваяЗапись = НаборЗаписей.Добавить();
		
		НоваяЗапись.Профиль = Профиль; 
		НоваяЗапись.ТоварМВМ = ТоварМВМ;
		НоваяЗапись.Номенклатура = Номенклатура; 
		НоваяЗапись.Характеристика = Характеристика;
		НоваяЗапись.Упаковка = Упаковка;
		
	КонецЕсли;
				
	НаборЗаписей.Записывать = Истина; 
	
	НаборЗаписей.Записать(Истина);
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#Область Остатки

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ТекстЗапросаОстатков() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	ИС_МВМ_Товары.Ссылка КАК ПолеСопоставления,
	|	ИС_МВМ_Товары.SapМВидео КАК SapМВМ,
	|	ИС_МВМ_Товары.Артикул КАК Артикул,
	|	ИС_МВМ_Товары.Штрихкод КАК Штрихкод,
	|	ИС_МВМ_СоответствиеТоваров.Номенклатура КАК Номенклатура,
	|	ИС_МВМ_СоответствиеТоваров.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	ИС_MP_ОграничениеОстатков.Остаток КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_МВМ_СоответствиеТоваров.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_МВМ_СоответствиеТоваров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_МВМ_СоответствиеТоваров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_МВМ_СоответствиеТоваров.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_МВМ_Товары КАК ИС_МВМ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_МВМ_СоответствиеТоваров КАК ИС_МВМ_СоответствиеТоваров
	|		ПО (ИС_МВМ_СоответствиеТоваров.Профиль = &Профиль)
	|			И (ИС_МВМ_СоответствиеТоваров.ТоварМВМ = ИС_МВМ_Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_МВМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_МВМ_Товары)) = ИС_МВМ_Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_МВМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_МВМ_Товары)) = ИС_МВМ_Товары.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_МВМ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_МВМ_Товары)) = ИС_МВМ_Товары.Ссылка)
	|ГДЕ
	|	ИС_МВМ_Товары.Профиль = &Профиль
	|	И НЕ ИС_МВМ_Товары.ПометкаУдаления";
	
	Текст = Текст + ";";
		
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК ТоварМВМ,
	|	ВТ_Сопоставление.SapМВМ КАК SapМВМ,
	|	ВТ_Сопоставление.Артикул КАК Артикул,
	|	ВТ_Сопоставление.Штрихкод КАК Штрихкод,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ВТ_Сопоставление.СкрываемыйОстаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ВТ_Сопоставление.СкрываемыйОстаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	ВТ_Сопоставление.ЕстьСкрываемыйОстаток КАК ЕстьСкрываемыйОстаток,
	|	ВТ_Сопоставление.РучнойОстаток КАК РучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	ВТ_Сопоставление.ЕстьРучнойОстаток КАК ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.ПоследнийВыгруженныйОстаток КАК ПоследнийВыгруженныйОстаток,
	|	ВТ_Сопоставление.ЕстьПоследнийВыгруженныйОстаток КАК ЕстьПоследнийВыгруженныйОстаток
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;		
	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт
	
	Событие = ИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	
	Настройки = ИС_МВМ_СерверПовтИсп.НастройкиОстатков(Профиль);
	
	СкрываемыйОстаток = 0;
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	                    
	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;       
	КонецЕсли;
	
	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;       
	КонецЕсли;
	
	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;       
	КонецЕсли;
			
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", Маркетплейс);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Настройки.Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_МВМ_Склады.НаправленияДеятельности КАК ИС_МВМ_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_МВМ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности
	|			И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_МВМ_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;

	Запрос.УстановитьПараметр("Назначение", Назначения);	
		
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_МВМ_Склады.Ссылка КАК Ссылка,
	|	ИС_МВМ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_МВМ_Склады.Склад КАК Склад,
	|	ИС_МВМ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_МВМ_Склады.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_МВМ_Склады КАК ИС_МВМ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МВМ_Склады.ГруппаСкладов КАК ИС_МВМ_СкладыГруппаСкладов
	|		ПО ИС_МВМ_Склады.Ссылка = ИС_МВМ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_МВМ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
			
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", ПараметрСклад, Профиль);
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ИнформацияОСкладе(Склад) Экспорт

	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_МВМ_Склады.Ссылка КАК Ссылка,
	|	ИС_МВМ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_МВМ_Склады.Склад КАК Склад,
	|	ИС_МВМ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_МВМ_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_МВМ_Склады КАК ИС_МВМ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_МВМ_Склады.ГруппаСкладов КАК ИС_МВМ_СкладыГруппаСкладов
	|		ПО ИС_МВМ_Склады.Ссылка = ИС_МВМ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_МВМ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";
	
	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = "";
		
	Пока ВыборкаСклад.Следующий() Цикл				
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    Результат = Результат + "Группа складов: " + Символы.ПС;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	Результат = Результат + Символы.Таб + " - " + ВыборкаГруппаСкладов.СкладГруппы + Символы.ПС;
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Результат = Результат + "Общая группа складов: " + ВыборкаСклад.ОбщаяГруппаСкладов + Символы.ПС;
		Иначе
			Результат = Результат + "Склад: " + ВыборкаСклад.Склад + Символы.ПС;		
		КонецЕсли;
	
	КонецЦикла;
    
    Возврат Результат;

КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ПолеСопоставленияОстатков() Экспорт
	Возврат "ТоварМВМ";	
КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Процедура ВыгрузитьОстатки(Профиль, Склад, ТаблицаВыгрузки = Неопределено) Экспорт
	
	Событие = ИмяСобытия("ВыгрузитьОстатки");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.МВМ;
	
	ПараметрыЗапроса = ПараметрыHTTPЗапроса(Профиль);
		
	МассивНастроек = ИС_МП_УправлениеОстатками.МассивПараметровВыгрузкиОстатков();	
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивНастроек);
		
	ИспользоватьПоследниеОстатки = Ложь;
	
	Если Настройки.ИспользоватьПоследниеОстатки <> Неопределено Тогда
		ИспользоватьПоследниеОстатки = Настройки.ИспользоватьПоследниеОстатки;
	КонецЕсли;
		
	Если ТаблицаВыгрузки = Неопределено Тогда		
		ТаблицаВыгрузки = ИС_МП_УправлениеОстатками.СформироватьТаблицуВыгрузки(Профиль, Склад, ПеречислениеМП, Настройки);		
	КонецЕсли;
	
	Если ТаблицаВыгрузки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	warehouseCode = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_МВМ_Склады.warehouseCode КАК warehouseCode
	|ИЗ
	|	Справочник.ИС_МВМ_Склады КАК ИС_МВМ_Склады
	|ГДЕ
	|	ИС_МВМ_Склады.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСклада = РезультатЗапроса.Выбрать();
	
	Если ВыборкаСклада.Следующий() Тогда
		warehouseCode = ВыборкаСклада.warehouseCode;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(warehouseCode) Тогда
		ТекстОшибки = "Не заполнен ""R-объект"" у склада " + Склад;
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	МассивОстатков = Новый Массив;
		
	Для Каждого Строка Из ТаблицаВыгрузки Цикл
		
		Остаток = Новый Структура;
		Остаток.Вставить("warehouseCode", warehouseCode);
		Остаток.Вставить("materialCode", Строка.SapМВМ);
		Остаток.Вставить("quantity", Строка.Остаток);
		Остаток.Вставить("unit", "PIECES");
		
		МассивОстатков.Добавить(Остаток);
		
	КонецЦикла;
		
	Результат = ИС_МВМ_АПИ.ВыгрузитьОстатки(Профиль, ПараметрыЗапроса, МассивОстатков);
	
	БылиОшибкиВыгрузки = Ложь;
	
	Если Результат = Неопределено Тогда
		БылиОшибкиВыгрузки = Истина;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Остатки успешно выгружены " + Результат);
	КонецЕсли;
	
	Если Не ИспользоватьПоследниеОстатки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не БылиОшибкиВыгрузки Тогда
		
		Для Каждого Строка Из ТаблицаВыгрузки Цикл
			ИС_МП_УправлениеОстатками.ЗаписатьПоследнийВыгруженныйОстаток(Профиль, ПеречислениеМП, Склад, 
				Строка.ТоварМВМ, Строка.Остаток);
		КонецЦикла;
	
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 27.10.24 УА #68001
Функция ИмяСобытия(Имя)
	Возврат СтрШаблон("ИС.МП.ИС_МВМ_Сервер.%1", Имя);
КонецФункции //- ИнфоСофт Ивонин К.А. 27.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 27.10.24 УА #68001
Процедура СоздатьИлиОбновитьТовар(Профиль, Ссылка, SapМВидео, СтрокаТовара)
	
	Событие = ИмяСобытия("СоздатьИлиОбновитьТовар");
	
	Если Ссылка.Пустая() Тогда
		Товар = Справочники.ИС_МВМ_Товары.СоздатьЭлемент();	
	Иначе
		Товар = Ссылка.ПолучитьОбъект();
	КонецЕсли;
	
	Товар.Профиль = Профиль;
	Товар.Наименование = СтрокаТовара.НаименованиеТовараВСистемеПоставщика_;
	Если Не ЗначениеЗаполнено(Товар.Наименование) Тогда
		Товар.Наименование = СтрокаТовара.УчетноеНаименование;	
	КонецЕсли;
	Товар.SapМВидео = СтрокаТовара.Sap_кодМвидео;
	Товар.SapЭльдорадо = СтрокаТовара.Sap_кодЭльдорадо;
	Товар.Штрихкод = СтрокаТовара.Штрих_кодТоварнойУпаковки_;
	Товар.УчетноеНаименование = СтрокаТовара.УчетноеНаименование;
	Товар.КодПоставщика = СтрокаТовара.КодВСистемеПоставщика;
	Товар.Артикул = СтрокаТовара.АртикулПроизводителя;
	Товар.Бренд = СтрокаТовара.БрендТовара;
	Товар.КодГруппы = СтрокаТовара.КодТоварнойГруппыМВидео;
	Товар.Группа = СтрокаТовара.НазваниеГруппыТовара;
	Товар.Статус = СтрокаТовара.СтатусТовара;
	Товар.Архивный = СтрокаТовара.ЗаархивированВЛКП;
	Товар.ДатаПубликации = СтрокаТовара.ДатаПубликацииВЛКП;
	
	Попытка
		Товар.Записать();
	Исключение
		ТестОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, ТестОшибки);
	КонецПопытки;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 27.10.24 УА #68001

//+ ИнфоСофт Ивонин К.А. 28.10.24 УА #68001
Функция ПараметрыHTTPЗапроса(Профиль)
	
	НастройкиСоединения = ИС_МВМ_СерверПовтИсп.НастройкиСоединения(Профиль);  
	
	ТекстОшибки = "";
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.АдресСервисаAPI) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Адрес Сервиса API"", проверьте настройки авторизации";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.Порт) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнен ""Порт"", проверьте настройки авторизации";
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ЗащищенноеСоединение) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""Защищенное соединение"", проверьте настройки авторизации";
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.ClientId) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""Client Id"", проверьте настройки авторизации";
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиСоединения.ApiKey) Тогда
		ТекстОшибки = ТекстОшибки + 
			"Для данного профиля не заполнено ""Api Key"", проверьте настройки авторизации";
	КонецЕсли;

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ВызватьИсключение(ТекстОшибки);
	КонецЕсли;
	
	ПараметрыЗапроса = ИС_МП_РаботаСHTTPЗапросами.СтруктураHTTPЗапроса();
	ПараметрыЗапроса.Сервер = НастройкиСоединения.АдресСервисаAPI;
	ПараметрыЗапроса.Порт = НастройкиСоединения.Порт;
	ПараметрыЗапроса.ЗащищенноеСоединение = НастройкиСоединения.ЗащищенноеСоединение;
	ПараметрыЗапроса.РежимОтладки = НастройкиСоединения.РежимОтладки;
	
	Если Не ЗначениеЗаполнено(НастройкиСоединения.AccessTokenИстекает) 
			Или НастройкиСоединения.AccessTokenИстекает <= ТекущаяДатаСеанса() Тогда
			
		Токены = ПолучитьТокен(Профиль, ПараметрыЗапроса, НастройкиСоединения);
		
		Если Токены = Неопределено Тогда
			ВызватьИсключение("Не удалось обновить токены доступа");
		КонецЕсли;
		
		Токен = Токены.accessToken;
		
	Иначе
		Токен = НастройкиСоединения.AccessToken;
	КонецЕсли;
	
	ПараметрыЗапроса.Заголовки.Вставить("Authorization", "Bearer " + Токен);
	
	Возврат ПараметрыЗапроса;

КонецФункции //- ИнфоСофт Ивонин К.А. 28.10.24 УА #68001

#КонецОбласти
